<template>
  <el-form class="organform" ref="rowDetail" :model="rowDetail">
    <div class="form_detail">
      <div class="text_foot">
        <span>甲方(用人单位)</span>
        <span>乙方(员工)</span>
      </div>
      <div class="text_foot">
        <span
          >名称：<span class="under">{{ rowDetail.deptName }}</span></span
        >
        <span
          >姓名：<span class="under">
            {{ rows.jiashiyuanxingming }}
          </span></span
        >
      </div>
      <div class="text_foot"></div>
      <div class="text_foot">
        <span></span>
        <span
          >身份证号码：<span class="under">{{ rowDetail.driverNo }}</span></span
        >
      </div>
      <div class="text_foot"></div>
      <div class="text_foot">
        <span></span>
        <span
          >住址：<span class="under">{{ rowDetail.driverAddress }}</span></span
        >
      </div>
      <div class="text_foot right_t"></div>
      <div></div>
      <p>
        根据《中华人民共和国劳动法》（以下简称《劳动法》）、《中华人民共和国劳动合同法》（以下简称《劳动合同法》）、《深圳市员工工资支付条例》（以下简称《工资支付条例》）等有关法律法规的规定，甲乙双方遵循合法、公平、平等自愿、协商一致、诚实信用的原则，签订本劳动合同，共同遵守本劳动合同所列条款。
      </p>
      <p>一、劳动合同期限</p>
      <p>
        （一）甲乙双方同意本劳动合同期限从
        <span style="text-decoration: underline">
          {{ rowDetail.ajwStartDate ? rowDetail.ajwStartDate : " ____" }}
        </span>
        起&nbsp;&nbsp;至
        <span style="text-decoration: underline">
          {{ rowDetail.ajwEndDate ? rowDetail.ajwEndDate : "____" }} </span
        >止。
      </p>
      <p>
        （二）试用期为：无，从/年/月/日起至/年/月/日止。（试用期包括在劳动合同期限内，如无试用期，则填写“无”）。
      </p>
      <p>二、工作内容和工作地点</p>
      <p>乙方的工作内容(岗位或工种)__________。</p>
      <p>乙方的工作地点：</p>
      <p>三、工作时间和休息休假</p>
      <p>（一）甲乙双方同意按以下第 2 种方式确定乙方的工作时间。</p>
      <p>
        1、标准工时制，即每日工作__________小时（不超过8小时），每周工作__________小时（不超过40小时），每周至少休息一日。
      </p>
      <p>2、不定时工作制，即经人力资源保障（劳动）部门批准，乙方所在岗位实行不定时工作制。</p>
      <p>
        3、综合计算工时工作制，即经人力资源保障（劳动）部门批准，乙方所在岗位实行综合计算工时工作制。
      </p>
      <p>（二）甲方由于生产经营需要延长工作时间的，按《劳动法》第四十一条执行。</p>
      <p>（三）乙方依法享有法定节假日、年休假、婚假、产假、丧假等假期。</p>
      <p>四、劳动报酬</p>
      <p>
        （一）甲方依法制定工资分配制度，并告知乙方。甲方支付给乙方的工资不得低于市政府公布的当年度最低工资。
      </p>
      <p>（二）乙方每月工资由基本工资、提成等组成。</p>
      <p>（三）甲方每月 日发放工资。甲方至少每月以货币形式向乙方支付一次工资。</p>
      <p>五、社会保险和福利待遇</p>
      <p>（一）甲乙双方按照国家和省、市有关规定，参加社会保险，缴纳社会保险费。</p>
      <p>
        （二）乙方患病或非因工负伤，甲方应按国家和省、市的有关规定给予乙方享受医疗期和医疗期待遇。
      </p>
      <p>
        （三）乙方患职业病、因工负伤的，甲方按《中华人民共和国职业病防治法》、《工伤保险条例》等有关法律法规的规定执行。
      </p>
      <p>六、劳动保护、劳动条件和职业危害防护</p>
      <p>
        （一）甲方按照国家和省、市有关劳动保护规定，提供符合国家安全卫生标准的劳动作业场所和必要的劳动防护用品，切实保护乙方在生产工作中的安全和健康。
      </p>
      <p>（二）甲方按照国家和省、市有关规定，做好女员工和未成年工的特殊劳动保护工作。</p>
      <p>
        （三）乙方从事__________作业，可能产生__________职业危害，甲方应采取__________防护措施，且按照国务院卫生行政部门的规定组织上岗前、在岗期间和离岗时的职业健康检查，并将检查结果如实告知乙方。职业健康检查费用由用人单位承担。
      </p>
      <p>
        （四）乙方有权拒绝甲方的违章指挥和强令冒险作业；对甲方危害生命安全和身体健康的行为，乙方有权要求改正或向有关部门举报。
      </p>
      <p>七、规章制度</p>
      <p>（一）甲方依法制定的规章制度，应当告知乙方。</p>
      <p>
        （二）乙方应遵守国家和省、市有关法律法规和甲方依法制定的规章制度，按时完成工作任务，提高职业技能，遵守安全操作规程和职业道德。特别应当遵守道路交通安全法律法规、不得饮酒或服用国家管制精神药品/毒品、不得超载、驾驶机动车时应检查安全机件性能。
      </p>
      <p>（三）乙方自觉遵守国家和省、市计划生育的有关规定。</p>
      <p>八、劳动合同变更</p>
      <p>
        甲乙双方经协商一致，可以变更劳动合同。变更劳动合同应采用书面形式。变更后的劳动合同文本双方各执一份。
      </p>
      <p>九、劳动合同解除和终止</p>
      <p>（一）甲乙双方协商一致，可以解除劳动合同。</p>
      <p>
        （二）乙方提前三十日以书面形式通知甲方，可以解除劳动合同；乙方试用期内提前三日通知甲方，可以解除劳动合同。
      </p>
      <p>（三）甲方有下列情形之一的，乙方可以通知甲方解除劳动合同：</p>
      <p>1、未按照劳动合同约定提供劳动保护或者劳动条件的；</p>
      <p>2、未及时足额支付劳动报酬的；</p>
      <p>3、未依法为乙方缴纳社会保险费，经乙方要求甲方缴纳，超过一个月仍未缴纳的；</p>
      <p>4、规章制度违反法律、法规的规定，损害乙方权益的；</p>
      <p>
        5、以欺诈、胁迫的手段或者乘人之危，使乙方在违背真实意思的情况下订立或者变更本劳动合同，致使劳动合同无效的；
      </p>
      <p>6、免除自己的法定责任、排除乙方权利，致使劳动合同无效的；</p>
      <p>7、违反法律、行政法规强制性规定，致使劳动合同无效的；</p>
      <p>8、法律、行政法规规定乙方可以解除劳动合同的其他情形。</p>
      <p>
        （四）甲方以暴力、威胁或者非法限制人身自由的手段强迫乙方劳动的，或者甲方违章指挥、强令冒险作业危及乙方人身安全的，乙方可以立即解除劳动合同，不需事先告知甲方。
      </p>
      <p>（五）乙方有下列情形之一的，甲方可以解除劳动合同：</p>
      <p>1、在试用期间被证明不符合录用条件的；</p>
      <p>2、严重违反甲方的规章制度的；</p>
      <p>3、严重失职，营私舞弊，给甲方造成重大损害的；</p>
      <p>
        4、同时与其他用人单位建立劳动关系，对完成本单位的工作任务造成严重影响，或者经甲方提出，拒不改正的；
      </p>
      <p>
        5、以欺诈、胁迫的手段或者乘人之危，使甲方在违背真实意思的情况下订立或者变更本劳动合同，致使劳动合同无效的；
      </p>
      <p>6、被依法追究刑事责任的。</p>
      <p>
        （六）有下列情形之一的，甲方提前三十日以书面形式通知乙方或者额外支付乙方一个月工资后，可以解除劳动合同，《劳动合同法》第四十二条规定的情形除外：
      </p>
      <p>
        1、乙方患病或者非因工负伤，在规定的医疗期满后不能从事原工作，也不能从事由甲方另行安排的工作的；
      </p>
      <p>2、乙方不能胜任工作，经过培训或者调整工作岗位，仍不能胜任工作的；</p>
      <p>
        3、劳动合同订立时所依据的客观情况发生重大变化，致使劳动合同无法履行，经甲乙双方协商，未能就变更劳动合同内容达成协议的。
      </p>
      <p>
        （七）有下列情形之一，甲方需要裁减人员二十人以上或者裁减不足二十人但占甲方职工总数百分之十以上的，甲方应提前三十日向工会或者全体职工说明情况，在听取工会或者职工的意见，并将裁减人员方案向人力资源保障（劳动）部门报告后，可以裁减人员，《劳动合同法》第四十二条规定的情形除外：
      </p>
      <p>1、依照企业破产法规定进行重整的；</p>
      <p>2、生产经营发生严重困难的；</p>
      <p>3、企业转产、重大技术革新或者经营方式调整，经变更劳动合同后，仍需裁减人员的；</p>
      <p>4、其他因劳动合同订立时所依据的客观经济情况发生重大变化，致使劳动合同无法履行的。</p>
      <p>（八）有下列情形之一的，劳动合同终止：</p>
      <p>1、劳动合同期满的；</p>
      <p>2、乙方达到法定退休年龄的；</p>
      <p>3、乙方死亡，或者被人民法院宣告死亡或者宣告失踪的；</p>
      <p>4、甲方被依法宣告破产的；</p>
      <p>5、甲方被吊销营业执照、责令关闭、撤销或者甲方决定提前解散的；</p>
      <p>6、法律、行政法规规定的其他情形。</p>
      <p>十、经济补偿</p>
      <p>（一）符合下列情形之一的，甲方应当向乙方支付经济补偿：</p>
      <p>
        1、甲方依据本劳动合同第九条第（一）项规定向乙方提出解除劳动合同并与乙方协商一致解除劳动合同的；
      </p>
      <p>2、乙方依据本劳动合同第九条第（三）项、第（四）项规定解除劳动合同的；</p>
      <p>3、甲方依据本劳动合同第九条第（六）项、第（七）项规定解除劳动合同的；</p>
      <p>
        4、除甲方维持或者提高劳动合同约定条件续订劳动合同，乙方不同意续订的情形外，依据本合同第九条第（八）项第1目规定终止固定期限劳动合同的；
      </p>
      <p>5、依据本合同第九条第（八）项第4目、第5目规定终止劳动合同的；</p>
      <p>6、法律、行政法规规定的其他情形。</p>
      <p>
        （二）甲乙双方解除或终止本劳动合同的，经济补偿的发放标准应按《劳动合同法》以及国家和省、市有关规定执行。甲方依法应向乙方支付经济补偿的，应在乙方办结工作交接时支付。
      </p>
      <p>十一、劳动合同解除和终止手续</p>
      <p>
        甲乙双方解除或终止本劳动合同的，乙方应按双方约定，办理工作交接等手续。甲方应当在解除或者终止劳动合同时出具解除或者终止劳动合同的证明，并在十五日内为乙方办理档案和社会保险关系转移手续。甲方出具的解除或者终止劳动合同的证明，应当写明劳动合同期限、解除或者终止劳动合同的日期、工作岗位、在本单位的工作年限。
      </p>
      <p>十二、争议处理</p>
      <p>
        甲乙双方发生劳动争议的，应先协商解决。协商不成的，可以向本单位工会寻求解决或向本单位劳动争议调解委员会申请调解；也可以直接向劳动争议仲裁委员会申请仲裁。
      </p>
      <p>十三、其它</p>
      <p>（一）本劳动合同未尽事宜或劳动合同条款与现行法律法规规定有抵触的，按现行法律法规执行。</p>
      <p>（二）本劳动合同自甲乙双方签字盖章之日起生效，涂改或未经书面授权代签无效。</p>
      <p>（三）本劳动合同一式两份，甲乙双方各执一份。</p>
      <div class="text_foot right_tt" style="margin-top: 40px">
        <span>甲方：（盖章）</span>
        <span>乙方：（签名）</span>
      </div>
      <div class="text_foot right_tt">
        <span>法定代表人（主要负责人）：</span>
        <div v-if="rowDetail.ajwAutographEnclosure" v-viewer>
          <img
            style="width: 80px; height: 100px; transform: rotate(-90deg); margin-top: -20px"
            :src="rowDetail.ajwAutographEnclosure"
            alt=""
          />
        </div>
        <span v-else>未签名</span>
      </div>
    </div>
  </el-form>
</template>

<script>
export default {
  props: {
    rowDetail: {
      type: Object,
      default: () => {
        return {};
      },
    },
    rows: {
      type: Object,
      default: () => {
        return {};
      },
    },
  },
  data() {
    return {
      subLoading: false,
      start: "",
      end: "",
    };
  },
  methods: {},
};
</script>
<style lang="scss" scoped>
.organform {
  width: 100%;
  height: calc(100% - 120px);
  margin-top: 10px;
  .form_detail {
    width: 100%;
    height: calc(100%);
    overflow: auto;
    p {
      line-height: 40px;
      color: #fff;
      word-break: break-word;
      margin-right: 20px;
      text-indent: 32px;
      font-size: 15px;
    }
    p:first-child {
      text-indent: 0px;
    }
    p:nth-child(2) {
      text-indent: 0px;
    }
    .text_foot {
      display: flex;
      justify-content: space-between;
      font-size: 15px;
      line-height: 30px;

      span {
        width: 50%;
        .under {
          text-decoration: underline;
        }
      }
    }
    .right_t {
      justify-content: end;
    }
    .right_tt {
      padding: 0 32px;
    }
    .foot_bot {
      padding: 13% 13% 0;
      p:nth-child(1) {
        font-size: 25px;
        font-weight: 600;
        text-align: center;
      }
      p:nth-child(2) {
        font-size: 17px;
        margin-top: 10px;
        margin-left: 40px;
      }
      p:nth-child(3) {
        text-align: right;
      }
      p:nth-child(4) {
        text-align: right;
      }
    }
  }
}
</style>
